Repository: AndreydeLara/MobileDeviceDevelopmentValidation
Catalog: Validation/Resources/*.lproj/Localizable.strings
Languages: es_419

source: People
es_419: Pesoas

source: Register
es_419: Registro

# ToRegister
source: Register
es_419: Registrar

source: Name
es_419: Nombre

source: Email
es_419: Correo electrónico

source: Birthday
es_419: Aniversário

source: Remove
es_419: Agente de mudanzas

source: Details
es_419: Detalles

source: Edition
es_419: Edición

source: Edit
es_419: Editar

# ErrorInitializingDatabase
source: Error trying to initialize the database
es_419: Error al intentar inicializar el banco de datos

source: Error getting data from database
es_419: Error al pegar dados del banco de dados

# ValidationError_EmptyName
source: Name cannot be empty
es_419: El nombre no puede estar vacío

# ValidationError_NameLessThanThreeCharacters
source: Name must be longer than 3 characters
es_419: El nombre debe tener más de 3 caracteres

# ValidationError_EmptyEmail
source: Email cannot be empty
es_419: El correo electrónico no puede estar vacío

# ValidationError_MustContainAtSign
source: Email must contain "@"
es_419: El correo electrónico debe contener "@"

# ValidationError_MustContainDot
source: The email must contain "."
es_419: El correo electrónico debe contener "."

# ValidationError_EmailLocalPartLessThanThreeCharacters
source: The local part of the email needs to be longer than 3 characters
es_419: La parte local del correo electrónico debe tener más de 3 caracteres

# ValidationError_BirthdayExceededToday
source: Birthday cannot exceed today
es_419: El cumpleaños no puede exceder hoy

# ValidationError_InvalidBirthday
source: Invalid birthday date
es_419: Fecha de cumpleaños no válida

# ValidationError_FailToCreatePerson
source: Failed to register person
es_419: Error al registrar a la persona

# ValidationError_Unknown
source: An unknown error has occurred
es_419: Un error desconocido a ocurrido
